## step-1 Import packages

In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

## step-2 Create a data frame (Df) using list

In [3]:
names=['ramesh','suresh', 'satish']
pd.DataFrame(names)
#pd.DataFrame(data, index, columns)

        0
0  ramesh
1  suresh
2  satish

## step-3 I want to check the index

In [4]:
names=['ramesh','suresh', 'satish']
ids=['A','B','C']
pd.DataFrame(names,ids)

        0
A  ramesh
B  suresh
C  satish

In [5]:
names=['ramesh','suresh', 'satish']
cols=['Names']
pd.DataFrame(names,cols)   ## it shows the error because of wrong argument

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)

In [6]:
names=['ramesh','suresh', 'satish']
cols=['Names']
pd.DataFrame(names,columns=cols)  ## use columns = cols

    Names
0  ramesh
1  suresh
2  satish

In [7]:
## argument 1
names=['ramesh','suresh', 'satish']
ids=['A','B','C']
pd.DataFrame(names,ids)

        0
A  ramesh
B  suresh
C  satish

In [9]:
## argument 2
names=['ramesh','suresh', 'satish']
cols=['Names']
pd.DataFrame(names,columns=cols)

    Names
A  ramesh
B  suresh
C  satish

In [11]:
## argument 3
names=['ramesh','suresh', 'satish']
ids=['A','B','C']
cols=['Names']
pd.DataFrame(names,ids, columns=cols)  ## all namers , ids, and columns are comming

    Names
A  ramesh
B  suresh
C  satish

## step- 4 Add the columns

In [12]:
names=['ramesh','suresh', 'satish','mahesh']
ids=['A','B','C','D']
cols=['Names']
pd.DataFrame(names,ids, columns=cols)

    Names
A  ramesh
B  suresh
C  satish
D  mahesh

## step - 5 Add data and columns

In [13]:
names=['ramesh','suresh', 'satish']
cols=['Names']
pd.DataFrame(names,columns=cols)

    Names
0  ramesh
1  suresh
2  satish

## step - 6 Multiple columns

In [16]:
names=['ramesh','suresh', 'satish']
age=[20,22,24]
pd.DataFrame(names,age)
# pd.DataFrame(data,index)

         0
20  ramesh
22  suresh
24  satish

In [17]:
names=['ramesh','suresh', 'satish']
age=[20,22,24]
pd.DataFrame(zip(names,age))  # add age as the columns
# pd.DataFrame(data,index)

        0   1
0  ramesh  20
1  suresh  22
2  satish  24

In [18]:
names=['ramesh','suresh', 'satish']
age=[20,22,24]
cols=['Names','Age']  ## add column names
pd.DataFrame(zip(names,age),columns=cols)
# pd.DataFrame(data,index)

    Names  Age
0  ramesh   20
1  suresh   22
2  satish   24

In [19]:
names=['ramesh','suresh', 'satish']
age=[20,22,24]
cols=['Names','Age']
df=pd.DataFrame(zip(names,age),
                columns=cols)  ## save the value in variable df
# pd.DataFrame(data,index)
df

    Names  Age
0  ramesh   20
1  suresh   22
2  satish   24

## step- 7  Add a new column to already existed data frame

In [ ]:
- In above first we have taken the data

- Then created a data frame

- Now we want to add new data based on

In [29]:
## add the new column city in the data frame 
city=['hyd','pune','blr']
city[0]

'hyd'

In [30]:
city=['hyd','pune','blr']
df['City']=city
df

    Names  Age  city  City
0  ramesh   20   hyd   hyd
1  suresh   22  pune  pune
2  satish   24   blr   blr

In [31]:
df['Marks']=[20,30,]  ## error display beacuse of lenght of values in the df
                      ## we give 2 values it has 3 values

ValueError: Length of values (2) does not match length of index (3)

In [33]:
# add new column
df['Marks']=[20,30,40]
df

    Names  Age  city  City  Marks
0  ramesh   20   hyd   hyd     20
1  suresh   22  pune  pune     30
2  satish   24   blr   blr     40

## Update the columns with the new values

In [34]:
# update the column which you want
df['Marks']

0    20
1    30
2    40
Name: Marks, dtype: int64

In [36]:
df['Marks']=[200,300,400]  # updated marks column
df

    Names  Age  city  City  Marks
0  ramesh   20   hyd   hyd    200
1  suresh   22  pune  pune    300
2  satish   24   blr   blr    400

## step -9 Create empty data frame and add the columns

In [54]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Mahesh']
df['Age']=[20,30,40]
df['City']=['MUM','chen','dlh']
df

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

## step- 10 Create a df using dictionary

In [9]:
d={'Names' : ['Ramesh','Suresh','Mahesh'],
  'Age' : [20,30,40],
  'City' : ['MUM','chen','dlh']}

df=pd.DataFrame(d)
df

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [10]:
d={'Names' : 'Ramesh',
  'Age' : 20,
  'City' : 'hyd'}

df=pd.DataFrame(d)
df          ## it getting error
            ##  If using all scalar values, you must pass an index

ValueError: If using all scalar values, you must pass an index

In [8]:
d={'Names' : 'Ramesh',
  'Age' : 20,
  'City' : 'hyd'}

df=pd.DataFrame(d, index=[0])
df          ## to dont come error provide the index for the data

    Names  Age City
0  Ramesh   20  hyd

## step - 11 Save the dataframe

In [ ]:
## file handling sessions
# directory//filename.ext
# filename.ext
# we are saving dataframe
# in two formats .csv  OR .xlsx
# 
# data.csv    dat.xlsx
  df.to_csv('data.csv')

In [45]:
df.to_csv('data.csv')

In [7]:
d={'Names' : 'Ramesh',
  'Age' : 20,
  'City' : 'hyd'}

df=pd.DataFrame(d, index=[0])
df.to_csv('data.csv')

**to save the file in different directory**

In [55]:
df.to_csv(r'C:\Users\SHRI\Documents\Practice DS\EDA_practice\data.csv')

In [51]:
df.to_excel('data.xlsx')  ## In excel format

## step - 12 Read the data frame

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# in order to read the data
# filename.ext
# open (mobox-short.txt).read()
# open(dummy.txt,mode='w').write('hello')

In [2]:
pd.read_csv('data.csv')    ## in that one extra column is coming name 0

   Unnamed: 0   Names  Age City
0           0  Ramesh   20  hyd

In [11]:
df

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [12]:
df

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [14]:
pd.read_excel('data.xlsx')
df

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [15]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Mahesh']
df['Age']=[20,30,40]
df['City']=['MUM','chen','dlh']
df

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [16]:
df.to_csv('data1.csv',index=False)  # their is no extra column is coming 
                                    # because we use index here

In [17]:
pd.read_csv('data1.csv')

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [19]:
df.to_excel('data1.xlsx', index=False)

In [20]:
pd.read_excel('data1.xlsx')

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [ ]:
## add one more column to df

In [21]:
Marks=[100,200,300]
df['Marks']=Marks
df

    Names  Age  City  Marks
0  Ramesh   20   MUM    100
1  Suresh   30  chen    200
2  Mahesh   40   dlh    300

## step - 13 Drop the column

In [22]:
# now drop the marks column

- labels

- axis

- index

- columns

- inplace

In [24]:
df.drop

<bound method DataFrame.drop of     Names  Age  City  Marks
0  Ramesh   20   MUM    100
1  Suresh   30  chen    200
2  Mahesh   40   dlh    300>

In [ ]:
df.drop()

# df.drop(
#     labels: 'IndexLabel | None' = None,
#     *,
#     axis: 'Axis' = 0,
#     index: 'IndexLabel | None' = None,
#     columns: 'IndexLabel | None' = None,
#     level: 'Level | None' = None,
#     inplace: 'bool' = False,
#     errors: 'IgnoreRaise' = 'raise',
# ) -> 'DataFrame | None'

**if you want to drom a index you need to use indexargument name**

In [25]:
df.drop(index=1)   ## index no 1 row will be dropped

    Names  Age City  Marks
0  Ramesh   20  MUM    100
2  Mahesh   40  dlh    300

In [26]:
df.drop(columns='Marks')  # whole columns will be dropped

    Names  Age  City
0  Ramesh   20   MUM
1  Suresh   30  chen
2  Mahesh   40   dlh

In [27]:
df.drop('Marks')  # whole columns will be dropped

KeyError: "['Marks'] not found in axis"

In [ ]:
df.drop(index=1)
df.drop(columns='Marks')
#===============================================
df.drop('Marks')  ## if i dont give argument lable
df.drop(1)  ## 1 beacome lable
#===============================================
# we need to provide axis
# axis = 0 indicates index
# axis = 1 indicates columns

In [28]:
df=pd.DataFrame()
df['Names']=['Ram','Sham','Ghansham']
df['Age']=[22,24,26]
df['City']=['sngl','kop','str']
df

      Names  Age  City
0       Ram   22  sngl
1      Sham   24   kop
2  Ghansham   26   str

In [30]:
Marks=[50,60,70]
df['Marks']=Marks
df

      Names  Age  City  Marks
0       Ram   22  sngl     50
1      Sham   24   kop     60
2  Ghansham   26   str     70

In [31]:
df.drop(index=1)    ## drop whole index

      Names  Age  City  Marks
0       Ram   22  sngl     50
2  Ghansham   26   str     70

In [32]:
df.drop(columns='Marks',axis=0)  ## drop whole marks columns

      Names  Age  City
0       Ram   22  sngl
1      Sham   24   kop
2  Ghansham   26   str

**inplace**

- when we do the operation the result output is not overwriting 

- means the original dataframe is same as it is.

- in orderr to do this we need use **inplace** 

- by default inplace = False

- make **inplace = True** if you want overwrite the result

In [37]:
df.drop('Marks',axis=1,inplace=True)
df

      Names  Age  City
0       Ram   22  sngl
1      Sham   24   kop
2  Ghansham   26   str

In [45]:
df=pd.DataFrame()
df['Names']=['Ram','Sham','Ghansham']
df['Age']=[22,24,26]
df['City']=['sngl','kop','str']
df['Marks']=[70,80,90]
df

      Names  Age  City  Marks
0       Ram   22  sngl     70
1      Sham   24   kop     80
2  Ghansham   26   str     90

In [46]:
df.drop('Marks',axis=1,inplace=True)
df

      Names  Age  City
0       Ram   22  sngl
1      Sham   24   kop
2  Ghansham   26   str

## step - 14 Rename the column

In [ ]:
df.rename()

# df.rename(
#     mapper: 'Renamer | None' = None,
#     *,
#     index: 'Renamer | None' = None,
#     columns: 'Renamer | None' = None,
#     axis: 'Axis | None' = None,
#     copy: 'bool | None' = None,
#     inplace: 'bool' = False,
#     level: 'Level | None' = None,
#     errors: 'IgnoreRaise' = 'ignore',
# ) -> 'DataFrame | None'

In [47]:
d={'City' : 'city'}    # {old : new}
# df.rename(<mapper>,<axis>)
df.rename('City' , axis=0,inplace=True)
df

TypeError: Index(...) must be called with a collection of some kind, 'City' was passed

In [ ]:
d={2:'B'}    ## {old : new}

df.rename

In [48]:
## create on emore 
## x=1 to 10
## y= square x
## z= cube x

df=pd.DataFrame()
df['Names']=['Ram','Sham','Ghansham']
df['Age']=[22,24,26]
df['City']=['sngl','kop','str']
df['Marks']=[70,80,90]
df

In [49]:
f=pd.DataFrame()
f['x']=[1,2,3,4]
f['y']=[1,4,9,16]
f['z']=[1,8,27,64]
f

   x   y   z
0  1   1   1
1  2   4   8
2  3   9  27
3  4  16  64

In [66]:
## create on emore 
## x=1 to 10
## y= square x
## z= cube x

x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
d1=pd.DataFrame(zip(x,y,z),
                columns=('X','Y','Z'))
d1

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [ ]:
- len

- shape : df.shape

- size : df.size

- head : df.head

- tail : df.tail

- isnull : df.isnull

- dtypes : df.types

- info : df.info

In [67]:
len(d1)

10

In [68]:
d1.shape()

(10, 3)

In [69]:
d1.size   ##Return an int representing the number of elements in this object.

30

In [78]:
d1.head()    ## Return the first `n` rows.

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [77]:
d1.tail()   ##Return the last `n` rows.

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [76]:
d1.isnull() ## DataFrame.isnull is an alias for DataFrame.isna.
             ## Detect missing values.

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [79]:
d1.isnull().sum()

X    0
Y    0
Z    0
dtype: int64

In [73]:
d1.dtype()

## if any cat columns occures
##

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [74]:
d1.info()   ## Print a concise summary of a DataFrame.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

## step - 15 Select a columns

In [81]:
d1.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [83]:
d1['X']   # int that no column name is coming

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [85]:
d1[['X','Y']]   ## for two columns use list   it shows columns name also

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [86]:
type(d1['X'])

# one diamensional  ## hence it not provide names

pandas.core.series.Series

In [88]:
type(d1[['X','Y']])

# two diamensional   ## hence it provide names

pandas.core.frame.DataFrame

In [89]:
d1['X'].shape   # one diamensional

(10,)

In [90]:
d1[['X','Y']].shape    # two diamensional

(10, 2)

In [93]:
d1   ## data frame

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [91]:
d1['X']   ## selecting one perticular column

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [92]:
d1['X'].values     ## extracting the data

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [96]:
d1
d1['Z']
d1['Z'].values

array([   1,    8,   27,   64,  125,  216,  343,  512,  729, 1000])

**to create the list of values in dat frame**

In [95]:
d1['X'].values.tolist()  ## to create list of values

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [97]:
d1
d1[['Y','Z']]
d1[['X','Z']]

    X     Z
0   1     1
1   2     8
2   3    27
3   4    64
4   5   125
5   6   216
6   7   343
7   8   512
8   9   729
9  10  1000

In [98]:
d1[['X','Z']].values.tolist()

[[1, 1],
 [2, 8],
 [3, 27],
 [4, 64],
 [5, 125],
 [6, 216],
 [7, 343],
 [8, 512],
 [9, 729],
 [10, 1000]]